print("Вы любите котиков?")
a = input()
if (a != "Да" or "Нет"):
    print("Ошибка! Партия не одобряет ваши действия")
    quit()
print("Уважаете ли вы Китайскую Народную Республику?")
b = input()
if (b != "Да" or "Нет"):
    print("Ошибка! Партия не одобряет ваши действия")
    quit()
if a == "Да" and b == "Да":
    print("Партия дает вам 100 очков социального рейтинга и миску риса")
elif a == "Нет" and b == "Да":
    print("Партия дает вам 50 очков социального рейтинга и отбирает миску риса")
elif a == "Да" and b == "Нет":
    print("Партия дает вам миску риса и лишает социального рейтинга")
else:
    print("Партия выгнала вас из страны.")
