print("Добро пожаловать в ♂DUNGEON♂")
print("Вы попали на первый этаж!")
print("Перед Вами три двери.")
print("Выберите дверь.")
print("Влево Прямо Направо")

a = input()

if (a == "Влево"):
    print("Вы прошли в коридор, перед вами две двери. В какую пойдете?")
    print("Влево Вправо")
    b = input()
    if (b == "Влево"):
        print("Вы вошли в темную комнату.")
        print("Запах сырости ударил вам в нос.")
        print("Дверь за вашей спиной захлопнулась лишая вас выхода.")
        print("В Ваш инвентарь зачислилось ♂300 монет♂.")
        print("Вы вышли на ♀нейтральную концовку♀...")
    elif (b == "Вправо"):
        print("После открытия двери глаза резанул яркий, после коридора, свет.")
        print("Вы выходите наружу и вдыхает полные легкие воздуха.")
        print("Ваш кошмар закончился, но это лишь одна из многочисленных комнат, которые обманывают путников.")
        print("Вы приглядываетесь к окружающим Вас стенам и замечаете что деревья, солнце и небо лишь нарисованная иллюзия.")
        print("Вы продвигаетесь к центру комнаты.")
        print("Слишится щелчок запуска механизма")
        print("Стены и потолок начали движение к центру комнаты.")
        print("Вас раздавило.")
        print("Вы вышли на ♀плохую концовку♀.")
        quit()
    else:
        print("Ошибка! Вас приняли в клуб кожаной пули двумя этажами ниже")
        quit()
elif (a == "Прямо"):
    print("Вы входите в комнату наполненную всевозможными тварями.")
    print("В центре комнаты стоит трон обитый кожей.")
    print("Пробиваясь сквозь толпу вы приближаетесь к трону, но вас сбивают с ног захватом со спины.")
    print("После продолжительной драки Вы выходите из нее победителем и садитесь на трон.")
    print("Вы вышли на истинную концовку и получаете достижение ♂Мастер подземелья♂")
elif (a == "Направо"):
    print("Вы заходите в комнату и видите перед собой темнокожего мужчину азиатской внешности в причудливой маске.")
    print("Он с улыбкой оборачивается к Вам и Вы узнаете в нем старого друга.")
    print("-Теперь ты свободен.- Мужчина указывает рукой на дверь с выходом из подземелья.")
    print("Вы удовлетворенно выдыхаете, ведь перед вами высвечивается достижение ♂Хорошая концовка♂")
    print("Не останавливаясь Вы вместе со своим другом выходите из подземелья.")
else:
    print("Ошибка! Вас приняли в клуб кожаной пули двумя этажами ниже")
    quit()

